### Import the library pandas as pd

#### Import արեք pandas գրադարանը pd  անունով

In [1]:
import pandas as pd

### Import the dataset gender.txt, assign to a variable gender

### Import արեք gender.txt dataset-ը, վերագրեք այն gender փոփոխականին

In [10]:
gender = pd.read_csv('data/gender.txt', sep = '|')
gender

     user_id  age gender     occupation zip_code
0          1   24      M     technician    85711
1          2   53      F          other    94043
2          3   23      M         writer    32067
3          4   24      M     technician    43537
4          5   33      F          other    15213
..       ...  ...    ...            ...      ...
938      939   26      F        student    33319
939      940   32      M  administrator    02215
940      941   20      M        student    97229
941      942   48      F      librarian    78209
942      943   22      M        student    77841

[943 rows x 5 columns]

### Check the datatypes in the dataframe

### Ստուգեք աղյուսակի սյուների տիպերը

In [4]:
gender.dtypes

user_id        int64
age            int64
gender        object
occupation    object
zip_code      object
dtype: object

### Convert the datatype of the column 'occupation' into categorical

### Վերածեք 'occupation' սյունը categorical տիպի

In [5]:
gender['occupation'].astype('category')

0         technician
1              other
2             writer
3         technician
4              other
           ...
938          student
939    administrator
940          student
941        librarian
942          student
Name: occupation, Length: 943, dtype: category
Categories (21, object): [administrator, artist, doctor, educator, ..., scientist, student, technician, writer]

### Replace the values in the column 'gender' with Male and Female accordingly. Do this with 2 methods: using apply and map.

### Փոխարինեք  'gender' սյան արժեքները Male և Female արժեքներով, արեք սա երկու տարբերակով՝ գործածելով apply և map ֆունկցիաները

In [6]:
gender_map = { 'M': 'Male', 'F': 'Female' }

gender['gender'] = gender['gender'].map(gender_map)

In [7]:
gender['gender']

0        Male
1      Female
2        Male
3        Male
4      Female
        ...
938    Female
939      Male
940      Male
941    Female
942      Male
Name: gender, Length: 943, dtype: object

In [11]:
gender['gender'] = gender['gender'].apply(lambda g: 'Female' if g == 'F' else 'Male')

In [12]:
gender['gender']

0        Male
1      Female
2        Male
3        Male
4      Female
        ...
938    Female
939      Male
940      Male
941    Female
942      Male
Name: gender, Length: 943, dtype: object

### Calculate the mean, median and std of age values for each occupation

### Հաշվեք age սյան mean, median և std արժեքները occupation սյան ամեն արժեքի համար

In [13]:
import numpy as np

In [14]:
gender['age'].agg([np.mean, np.median, np.std])

mean      34.051962
median    31.000000
std       12.192740
Name: age, dtype: float64

### Create a new column 'birth_year' and get the birth year of each individual using the values from the column 'age'

### Ստեղծեք 'birth_year' անունով նոր սյուն, որում կպահեք ամեն մարդու ծննդյան տարին, որը կստանաք օգտագործելով 'birth_year' սյան արժեքները

In [15]:
import datetime

current_year = datetime.date.today().strftime('%Y')

current_year

'2021'

In [16]:
gender['birth_year'] = int(current_year) - gender['age']

In [17]:
gender

     user_id  age  gender     occupation zip_code  birth_year
0          1   24    Male     technician    85711        1997
1          2   53  Female          other    94043        1968
2          3   23    Male         writer    32067        1998
3          4   24    Male     technician    43537        1997
4          5   33  Female          other    15213        1988
..       ...  ...     ...            ...      ...         ...
938      939   26  Female        student    33319        1995
939      940   32    Male  administrator    02215        1989
940      941   20    Male        student    97229        2001
941      942   48  Female      librarian    78209        1973
942      943   22    Male        student    77841        1999

[943 rows x 6 columns]

### Create a new column 'birth_date' using the column 'birth_year' and current month and day values"

### Ստեղծեք 'birth_date' անունով նոր սյուն, որի արժեքները կստանաք գործածելով 'birth_year' սյան արժեքները ինչպես նաև այս պահի ամիսն ու օրը։

In [18]:
import datetime

today = datetime.datetime.today()

current_month = today.month
current_day = today.day

In [19]:
gender['birth_date'] = pd.to_datetime(
    gender['birth_year'], 
    format = '%Y',
).apply(lambda dt: dt.replace(month = current_month, day = current_day))

In [20]:
gender

     user_id  age  gender     occupation zip_code  birth_year birth_date
0          1   24    Male     technician    85711        1997 1997-05-07
1          2   53  Female          other    94043        1968 1968-05-07
2          3   23    Male         writer    32067        1998 1998-05-07
3          4   24    Male     technician    43537        1997 1997-05-07
4          5   33  Female          other    15213        1988 1988-05-07
..       ...  ...     ...            ...      ...         ...        ...
938      939   26  Female        student    33319        1995 1995-05-07
939      940   32    Male  administrator    02215        1989 1989-05-07
940      941   20    Male        student    97229        2001 2001-05-07
941      942   48  Female      librarian    78209        1973 1973-05-07
942      943   22    Male        student    77841        1999 1999-05-07

[943 rows x 7 columns]

### Make sure the datatype of the columns 'birth_year' and 'birth_date' is datetime

### Վստահ եղեք, որ 'birth_year' և 'birth_date' սյուները datetime տիպի են

In [21]:
gender['birth_year'] = gender['birth_year'].astype('datetime64[ns]')
gender['birth_date'] = gender['birth_date'].astype('datetime64[ns]')

In [22]:
gender.dtypes

user_id                int64
age                    int64
gender                object
occupation            object
zip_code              object
birth_year    datetime64[ns]
birth_date    datetime64[ns]
dtype: object

### Change the values in the column user_id to have the values of type string of the same length (use the method of your choice). As an example, if we have values 0, 1 and 100, we could have values '000', '001' and '100' as a result.

### Փոխեք user_id սյան արժեքները նույն երկարություն ունեցող string տիպի արժեքներով՝ գործածելով Ձեր ցանկացած մեթոդը։ Որպես օրինակ, եթե ունեք 0, 1 և 100 աևժեքներ, Ձեր արդյունքը կարող է լինել '000', '001' և'100'

In [23]:
max_user_id = gender['user_id'].max()
max_len = len(str(max_user_id))
max_len

3

In [24]:
gender['user_id'] = gender['user_id'].apply(lambda u_id: str(u_id).zfill(max_len))

In [25]:
gender

,user_id,age,gender,occupation,zip_code,birth_year,birth_date
0,001,24,Male,technician,85711,1970-01-01 00:00:00.000001997,1997-05-07
1,002,53,Female,other,94043,1970-01-01 00:00:00.000001968,1968-05-07
2,003,23,Male,writer,32067,1970-01-01 00:00:00.000001998,1998-05-07
3,004,24,Male,technician,43537,1970-01-01 00:00:00.000001997,1997-05-07
4,005,33,Female,other,15213,1970-01-01 00:00:00.000001988,1988-05-07
...,...,...,...,...,...,...,...
938,939,26,Female,student,33319,1970-01-01 00:00:00.000001995,1995-05-07
939,940,32,Male,administrator,02215,1970-01-01 00:00:00.000001989,1989-05-07
940,941,20,Male,student,97229,1970-01-01 00:00:00.000002001,2001-05-07
941,942,48,Female,librarian,78209,1970-01-01 00:00:00.000001973,1973-05-07
942,943,22,Male,student,77841,1970-01-01 00:00:00.000001999,1999-05-07